<h3>二つの参照形式</h3>
<p>エクセルには二つの参照方式が採用されている。そのうち一つは皆さんもよくご存じのA1形式である。<br>
    A1形式はその名の通り、セルの一番左上がA行1列であるという意味で、行をA,B,C、列を1,2,3と表記していくのだ。そしてもう一つ、あまりなじみがないであろう表記がある。<br>
    それがR1C1形式である。やはりこちらもセルの一番上がR1C1であるという意味なのだが、行をR(Row), 列をC(Column)で表すものである。<br>
    R1C1とは、あるセルを基準として、そこから相対的にどれだけ移動したかで表す形式である。A1形式が「絶対参照」、R1C1が「相対参照」というわけだ。<br>
    とはいえ、あなたがマクロ（VBA）を使うのでもなければ、R1C1形式は忘れてもらってよい。単にわかりづらく混乱するだけである。一方、マクロを用いた業務改善をお考えのあなたはぜひR1C1形式を使いこなせるようになっておこう！<br><br>
    マクロでR1C1形式が多用されるのは、相対位置でセルを指定し、操作することが非常に多いからである。<br>
</p>